module.exports=function(req,res){	
	/*
	 * 状态 - 信息
	 * 1 - 注册成功，跳转到注册成功页面
	 * 2 - 注册失败
	 * 4 - 手机号重复
	 * 5 - 手机格式不正确
	 * 12 - 手机号为空
	 * 13 - 手机验证码为空
	 * 14 - 验证码不匹配
	 * 15 - 手机号不匹配
	 * 16 - 获取短信验证码失败,请刷新页面后重试!
	 * 17 - 发送验证码失败
	 * 18 - session中不存在验证码
	 */
	var status = "1";
	var msgMap={
		"1":"注册成功，跳转到注册成功页面",
		"2":"注册失败",
		"4":"手机号重复",
		"5":"手机格式不正确",
		"12":"手机号为空",
		"13":"手机验证码为空",
		"14":"验证码不匹配",
		"15":"手机号不匹配",
		"16":"获取短信验证码失败,请刷新页面后重试！",
		"17":"发送验证码失败",
		"18":"session中不存在验证码"
	}
	var result={
			"status" : status,
			"msg" : msgMap[status]
		};
	return result;
}