module.exports=function(req,res){	
	/*
	 * 状态 - 信息
	 * 1 - 成功，跳转到注册第二步	
	 * 3 - 密码解密失败
	 * 4 - 手机号重复
	 * 5 - 手机格式不正确
	 * 6 - 密码格式错误
	 * 7 - 参数校验失败
	 * 8 - 密码为空
	 * 12 - 手机号为空
	 * 16 - 获取短信验证码失败,请刷新页面后重试!
	 * 17 - 发送验证码失败
	 */

	var status = "1";
	var msgMap={		
		"1":"成功，跳转到注册第二步",
		"3":"密码解密失败",
		"4":"手机号重复",
		"5":"手机格式不正确",
		"6":"密码格式错误",
		"7":"参数校验失败",
		"8":"密码为空",
		"12":"手机号为空",
		"16":"获取短信验证码失败,请刷新页面后重试！",
		"17":"发送验证码失败"
	}
	var result={
			"status" : status,
			"msg" : msgMap[status]
		};
	return result;
}